monitoring/k6/last-resilient-result.txt
RUN_ID=db-chaos-50k-20260523060052
BASE_URL=http://[::1]:8080
TOTAL_ORDERS=1
VUS=1
MAX_DURATION=1m
MAX_ATTEMPTS=150
RETRY_DELAY_SECONDS=2
REQUEST_TIMEOUT=5s
ITERATION_DELAY_SECONDS=0.2
START=2026-05-23T06:00:56.221Z
END=2026-05-23T06:00:56.222Z
     ✓ order eventually accepted
     ✓ order finished within retry budget

     attempts_per_order.............: avg=1        min=1        med=1        p(90)=1        p(95)=1        p(99)=1        max=1       
   ✓ checks.........................: 100.00% ✓ 2        ✗ 0
     data_received..................: 552 B   1.9 kB/s
     data_sent......................: 343 B   1.2 kB/s
   ✓ final_order_failed.............: 0.00%   ✓ 0        ✗ 1
     http_req_blocked...............: avg=516.2µs  min=516.2µs  med=516.2µs  p(90)=516.2µs  p(95)=516.2µs  p(99)=516.2µs  max=516.2µs 
     http_req_connecting............: avg=516.2µs  min=516.2µs  med=516.2µs  p(90)=516.2µs  p(95)=516.2µs  p(99)=516.2µs  max=516.2µs 
   ✓ http_req_duration..............: avg=42.59ms  min=42.59ms  med=42.59ms  p(90)=42.59ms  p(95)=42.59ms  p(99)=42.59ms  max=42.59ms 
       { expected_response:true }...: avg=42.59ms  min=42.59ms  med=42.59ms  p(90)=42.59ms  p(95)=42.59ms  p(99)=42.59ms  max=42.59ms 
     http_req_failed................: 0.00%   ✓ 0        ✗ 1
     http_req_receiving.............: avg=0s       min=0s       med=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
     http_req_sending...............: avg=0s       min=0s       med=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       p(90)=0s       p(95)=0s       p(99)=0s       max=0s      
     http_req_waiting...............: avg=42.59ms  min=42.59ms  med=42.59ms  p(90)=42.59ms  p(95)=42.59ms  p(99)=42.59ms  max=42.59ms 
     http_reqs......................: 1       3.522594/s
     iteration_duration.............: avg=244.65ms min=244.65ms med=244.65ms p(90)=244.65ms p(95)=244.65ms p(99)=244.65ms max=244.65ms
     iterations.....................: 1       3.522594/s