monitoring/k6/last-resilient-result.txt
RUN_ID=db-chaos-50k-20260512052455
BASE_URL=http://[::1]:8080
TOTAL_ORDERS=50000
VUS=100
MAX_DURATION=30m
MAX_ATTEMPTS=150
RETRY_DELAY_SECONDS=2
REQUEST_TIMEOUT=5s
ITERATION_DELAY_SECONDS=0.2
START=2026-05-12T05:29:29.315Z
END=2026-05-12T05:29:29.315Z
     ✓ order eventually accepted
     ✓ order finished within retry budget

     attempts_per_order.............: avg=1.06632  min=1        med=1        p(90)=1       p(95)=1        p(99)=1        max=18    
   ✓ checks.........................: 100.00% ✓ 100000     ✗ 0    
     data_received..................: 29 MB   108 kB/s
     data_sent......................: 19 MB   69 kB/s
   ✓ final_order_failed.............: 0.00%   ✓ 0          ✗ 50000
     http_req_blocked...............: avg=35.93µs  min=0s       med=0s       p(90)=0s      p(95)=513µs    p(99)=709.6µs  max=3.48ms
     http_req_connecting............: avg=32.73µs  min=0s       med=0s       p(90)=0s      p(95)=506.7µs  p(99)=677.97µs max=2.35ms
   ✓ http_req_duration..............: avg=194.32ms min=511.49µs med=8.11ms   p(90)=13.64ms p(95)=3s       p(99)=3.01s    max=3.1s  
       { expected_response:true }...: avg=9.85ms   min=511.49µs med=7.97ms   p(90)=10.95ms p(95)=12.85ms  p(99)=22.4ms   max=2.18s 
     http_req_failed................: 6.21%   ✓ 3316       ✗ 50000
     http_req_receiving.............: avg=133.6µs  min=0s       med=0s       p(90)=524.2µs p(95)=768.9µs  p(99)=1.51ms   max=8.3ms 
     http_req_sending...............: avg=8.02µs   min=0s       med=0s       p(90)=0s      p(95)=0s       p(99)=511.78µs max=1.73ms
     http_req_tls_handshaking.......: avg=0s       min=0s       med=0s       p(90)=0s      p(95)=0s       p(99)=0s       max=0s    
     http_req_waiting...............: avg=194.18ms min=511.49µs med=8ms      p(90)=13.49ms p(95)=3s       p(99)=3.01s    max=3.1s  
     http_reqs......................: 53316   197.245237/s
     iteration_duration.............: avg=540.39ms min=200.69ms med=208.44ms p(90)=211.5ms p(95)=213.43ms p(99)=225.95ms max=1m25s 
     iterations.....................: 50000   184.977528/s
     recovered_orders...............: 200     0.73991/s
     retry_attempts.................: 3316    12.26771/s
     vus............................: 100     min=100      max=100
     vus_max........................: 100     min=100      max=100